# Работа с GIT. Создадим калькулятор
# в первом файле сделаем простую арифметику
# второй фаил - интерфейс пользователя
# третий фаил - апгрейд интерфейса и от него пойдут еще две ветки
# тригонометрия - первый фаил с cos,sin,tg, ctg. второй sec и cosec.
# функции - первый корень и возведение в степень, второй факториал.
# эти два файла соеденяем в четвертом файле resylt, (merge)
#  пятый фаил - +/- трех чисел return+/-a,b,c
# шестой фаил - финальный - результат работы всего калькулятора!!!

# ARIFMETIKA
def summ(a,b):
    return a + b

def subtraction(a,b):
    return a-b


def multiplication(a,b):
    return a*b


def devision(a,b):
    return a/b


