 # print("Hello Word")
# 1. Напишите функцию сложения трехзначных чисел
# 2. Напишите характеристику, которая определяется чётно ли числом
# 3. Напишите характеристику, которая определяет положительное число
# 4. Напишите функцию, которая дает выдающиеся деления на 5
# 5. Напишите особенность, которая имеет место в случае положительности и нечетности.
# 6. Напишите характеристику, считающую факториал введённого числа
# 7. Напишите функцию, считающую квадратное уравнение (на вход, b, c; на выход x1 и x2).
# Решить надо 2 способами: через дискриминант и через попадание Виета


# a = input(int("Введите первое число: "))
# b = input(int("Введите второе число: "))
# c = input(int("Введите третье число: "))
# def symm (a, b, c ):
  #  return a + b + c
# print (symm)


# print('1-е число')
# a = int(input())
# print('2-е число')
# b = int(input())
# print('3-е число')
# c = int(input())
# def summ(a, b, c):
#     return a + b + c
# print (summ(a,b,c))

# 2. Напишите характеристику, которая определяется чётно ли числом

# print('Введите число')
# a = int(input())
# if a % 2 == 0:
#     print("Число четное")
# else:
#     print("Число не четное")

# 3. Напишите характеристику, которая определяет положительное число

# print('Введите число')
# a = int(input())
# if a > 0:
#     print("Число +")
# else:
#     print("Число -")

# 4. Напишите функцию, которая дает выдающиеся деления на 5
# 5. Напишите особенность, которая имеет место в случае положительности и нечетности.


# 6. Напишите характеристику, считающую факториал введённого числа
# 7. Напишите функцию, считающую квадратное уравнение (на вход, b, c; на выход x1 и x2).
# Решить надо 2 способами: через дискриминант и через попадание Виета

